MagnusEffect/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          19296;
        startFace       15416;
    }
    cylinder
    {
        type            wall;
        physicalType    wall;
        nFaces          244;
        startFace       34712;
    }
    domain_boundary
    {
        type            patch;
        physicalType    patch;
        nFaces          64;
        startFace       34956;
    }
)

// ************************************************************************* //
